---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeInfo.#ctor
source: html/0c0b01db-d1cb-0754-b469-f6290b36b75b.htm
---
# Autodesk.Revit.DB.ExportLinetypeInfo.#ctor Method

Constructs a new default ExportLinetypeInfo.

## Syntax (C#)
```csharp
public ExportLinetypeInfo()
```